graph(%0 : Float(10, 3, 224, 224)
      %1 : Float(64, 3, 7, 7)
      %2 : Float(64)
      %3 : Float(64)
      %4 : Float(64)
      %5 : Float(64)
      %6 : Long()
      %7 : Float(64)
      %8 : Float(64)
      %9 : Float(64)
      %10 : Float(64)
      %11 : Long()
      %12 : Float(128, 64, 1, 1)
      %13 : Float(128)
      %14 : Float(128)
      %15 : Float(128)
      %16 : Float(128)
      %17 : Long()
      %18 : Float(32, 128, 3, 3)
      %19 : Float(96)
      %20 : Float(96)
      %21 : Float(96)
      %22 : Float(96)
      %23 : Long()
      %24 : Float(128, 96, 1, 1)
      %25 : Float(128)
      %26 : Float(128)
      %27 : Float(128)
      %28 : Float(128)
      %29 : Long()
      %30 : Float(32, 128, 3, 3)
      %31 : Float(128)
      %32 : Float(128)
      %33 : Float(128)
      %34 : Float(128)
      %35 : Long()
      %36 : Float(128, 128, 1, 1)
      %37 : Float(128)
      %38 : Float(128)
      %39 : Float(128)
      %40 : Float(128)
      %41 : Long()
      %42 : Float(32, 128, 3, 3)
      %43 : Float(160)
      %44 : Float(160)
      %45 : Float(160)
      %46 : Float(160)
      %47 : Long()
      %48 : Float(128, 160, 1, 1)
      %49 : Float(128)
      %50 : Float(128)
      %51 : Float(128)
      %52 : Float(128)
      %53 : Long()
      %54 : Float(32, 128, 3, 3)
      %55 : Float(192)
      %56 : Float(192)
      %57 : Float(192)
      %58 : Float(192)
      %59 : Long()
      %60 : Float(128, 192, 1, 1)
      %61 : Float(128)
      %62 : Float(128)
      %63 : Float(128)
      %64 : Float(128)
      %65 : Long()
      %66 : Float(32, 128, 3, 3)
      %67 : Float(224)
      %68 : Float(224)
      %69 : Float(224)
      %70 : Float(224)
      %71 : Long()
      %72 : Float(128, 224, 1, 1)
      %73 : Float(128)
      %74 : Float(128)
      %75 : Float(128)
      %76 : Float(128)
      %77 : Long()
      %78 : Float(32, 128, 3, 3)
      %79 : Float(256)
      %80 : Float(256)
      %81 : Float(256)
      %82 : Float(256)
      %83 : Long()
      %84 : Float(128, 256, 1, 1)
      %85 : Float(128)
      %86 : Float(128)
      %87 : Float(128)
      %88 : Float(128)
      %89 : Long()
      %90 : Float(128, 128, 1, 1)
      %91 : Float(128)
      %92 : Float(128)
      %93 : Float(128)
      %94 : Float(128)
      %95 : Long()
      %96 : Float(32, 128, 3, 3)
      %97 : Float(160)
      %98 : Float(160)
      %99 : Float(160)
      %100 : Float(160)
      %101 : Long()
      %102 : Float(128, 160, 1, 1)
      %103 : Float(128)
      %104 : Float(128)
      %105 : Float(128)
      %106 : Float(128)
      %107 : Long()
      %108 : Float(32, 128, 3, 3)
      %109 : Float(192)
      %110 : Float(192)
      %111 : Float(192)
      %112 : Float(192)
      %113 : Long()
      %114 : Float(128, 192, 1, 1)
      %115 : Float(128)
      %116 : Float(128)
      %117 : Float(128)
      %118 : Float(128)
      %119 : Long()
      %120 : Float(32, 128, 3, 3)
      %121 : Float(224)
      %122 : Float(224)
      %123 : Float(224)
      %124 : Float(224)
      %125 : Long()
      %126 : Float(128, 224, 1, 1)
      %127 : Float(128)
      %128 : Float(128)
      %129 : Float(128)
      %130 : Float(128)
      %131 : Long()
      %132 : Float(32, 128, 3, 3)
      %133 : Float(256)
      %134 : Float(256)
      %135 : Float(256)
      %136 : Float(256)
      %137 : Long()
      %138 : Float(128, 256, 1, 1)
      %139 : Float(128)
      %140 : Float(128)
      %141 : Float(128)
      %142 : Float(128)
      %143 : Long()
      %144 : Float(32, 128, 3, 3)
      %145 : Float(288)
      %146 : Float(288)
      %147 : Float(288)
      %148 : Float(288)
      %149 : Long()
      %150 : Float(128, 288, 1, 1)
      %151 : Float(128)
      %152 : Float(128)
      %153 : Float(128)
      %154 : Float(128)
      %155 : Long()
      %156 : Float(32, 128, 3, 3)
      %157 : Float(320)
      %158 : Float(320)
      %159 : Float(320)
      %160 : Float(320)
      %161 : Long()
      %162 : Float(128, 320, 1, 1)
      %163 : Float(128)
      %164 : Float(128)
      %165 : Float(128)
      %166 : Float(128)
      %167 : Long()
      %168 : Float(32, 128, 3, 3)
      %169 : Float(352)
      %170 : Float(352)
      %171 : Float(352)
      %172 : Float(352)
      %173 : Long()
      %174 : Float(128, 352, 1, 1)
      %175 : Float(128)
      %176 : Float(128)
      %177 : Float(128)
      %178 : Float(128)
      %179 : Long()
      %180 : Float(32, 128, 3, 3)
      %181 : Float(384)
      %182 : Float(384)
      %183 : Float(384)
      %184 : Float(384)
      %185 : Long()
      %186 : Float(128, 384, 1, 1)
      %187 : Float(128)
      %188 : Float(128)
      %189 : Float(128)
      %190 : Float(128)
      %191 : Long()
      %192 : Float(32, 128, 3, 3)
      %193 : Float(416)
      %194 : Float(416)
      %195 : Float(416)
      %196 : Float(416)
      %197 : Long()
      %198 : Float(128, 416, 1, 1)
      %199 : Float(128)
      %200 : Float(128)
      %201 : Float(128)
      %202 : Float(128)
      %203 : Long()
      %204 : Float(32, 128, 3, 3)
      %205 : Float(448)
      %206 : Float(448)
      %207 : Float(448)
      %208 : Float(448)
      %209 : Long()
      %210 : Float(128, 448, 1, 1)
      %211 : Float(128)
      %212 : Float(128)
      %213 : Float(128)
      %214 : Float(128)
      %215 : Long()
      %216 : Float(32, 128, 3, 3)
      %217 : Float(480)
      %218 : Float(480)
      %219 : Float(480)
      %220 : Float(480)
      %221 : Long()
      %222 : Float(128, 480, 1, 1)
      %223 : Float(128)
      %224 : Float(128)
      %225 : Float(128)
      %226 : Float(128)
      %227 : Long()
      %228 : Float(32, 128, 3, 3)
      %229 : Float(512)
      %230 : Float(512)
      %231 : Float(512)
      %232 : Float(512)
      %233 : Long()
      %234 : Float(256, 512, 1, 1)
      %235 : Float(256)
      %236 : Float(256)
      %237 : Float(256)
      %238 : Float(256)
      %239 : Long()
      %240 : Float(128, 256, 1, 1)
      %241 : Float(128)
      %242 : Float(128)
      %243 : Float(128)
      %244 : Float(128)
      %245 : Long()
      %246 : Float(32, 128, 3, 3)
      %247 : Float(288)
      %248 : Float(288)
      %249 : Float(288)
      %250 : Float(288)
      %251 : Long()
      %252 : Float(128, 288, 1, 1)
      %253 : Float(128)
      %254 : Float(128)
      %255 : Float(128)
      %256 : Float(128)
      %257 : Long()
      %258 : Float(32, 128, 3, 3)
      %259 : Float(320)
      %260 : Float(320)
      %261 : Float(320)
      %262 : Float(320)
      %263 : Long()
      %264 : Float(128, 320, 1, 1)
      %265 : Float(128)
      %266 : Float(128)
      %267 : Float(128)
      %268 : Float(128)
      %269 : Long()
      %270 : Float(32, 128, 3, 3)
      %271 : Float(352)
      %272 : Float(352)
      %273 : Float(352)
      %274 : Float(352)
      %275 : Long()
      %276 : Float(128, 352, 1, 1)
      %277 : Float(128)
      %278 : Float(128)
      %279 : Float(128)
      %280 : Float(128)
      %281 : Long()
      %282 : Float(32, 128, 3, 3)
      %283 : Float(384)
      %284 : Float(384)
      %285 : Float(384)
      %286 : Float(384)
      %287 : Long()
      %288 : Float(128, 384, 1, 1)
      %289 : Float(128)
      %290 : Float(128)
      %291 : Float(128)
      %292 : Float(128)
      %293 : Long()
      %294 : Float(32, 128, 3, 3)
      %295 : Float(416)
      %296 : Float(416)
      %297 : Float(416)
      %298 : Float(416)
      %299 : Long()
      %300 : Float(128, 416, 1, 1)
      %301 : Float(128)
      %302 : Float(128)
      %303 : Float(128)
      %304 : Float(128)
      %305 : Long()
      %306 : Float(32, 128, 3, 3)
      %307 : Float(448)
      %308 : Float(448)
      %309 : Float(448)
      %310 : Float(448)
      %311 : Long()
      %312 : Float(128, 448, 1, 1)
      %313 : Float(128)
      %314 : Float(128)
      %315 : Float(128)
      %316 : Float(128)
      %317 : Long()
      %318 : Float(32, 128, 3, 3)
      %319 : Float(480)
      %320 : Float(480)
      %321 : Float(480)
      %322 : Float(480)
      %323 : Long()
      %324 : Float(128, 480, 1, 1)
      %325 : Float(128)
      %326 : Float(128)
      %327 : Float(128)
      %328 : Float(128)
      %329 : Long()
      %330 : Float(32, 128, 3, 3)
      %331 : Float(512)
      %332 : Float(512)
      %333 : Float(512)
      %334 : Float(512)
      %335 : Long()
      %336 : Float(128, 512, 1, 1)
      %337 : Float(128)
      %338 : Float(128)
      %339 : Float(128)
      %340 : Float(128)
      %341 : Long()
      %342 : Float(32, 128, 3, 3)
      %343 : Float(544)
      %344 : Float(544)
      %345 : Float(544)
      %346 : Float(544)
      %347 : Long()
      %348 : Float(128, 544, 1, 1)
      %349 : Float(128)
      %350 : Float(128)
      %351 : Float(128)
      %352 : Float(128)
      %353 : Long()
      %354 : Float(32, 128, 3, 3)
      %355 : Float(576)
      %356 : Float(576)
      %357 : Float(576)
      %358 : Float(576)
      %359 : Long()
      %360 : Float(128, 576, 1, 1)
      %361 : Float(128)
      %362 : Float(128)
      %363 : Float(128)
      %364 : Float(128)
      %365 : Long()
      %366 : Float(32, 128, 3, 3)
      %367 : Float(608)
      %368 : Float(608)
      %369 : Float(608)
      %370 : Float(608)
      %371 : Long()
      %372 : Float(128, 608, 1, 1)
      %373 : Float(128)
      %374 : Float(128)
      %375 : Float(128)
      %376 : Float(128)
      %377 : Long()
      %378 : Float(32, 128, 3, 3)
      %379 : Float(640)
      %380 : Float(640)
      %381 : Float(640)
      %382 : Float(640)
      %383 : Long()
      %384 : Float(128, 640, 1, 1)
      %385 : Float(128)
      %386 : Float(128)
      %387 : Float(128)
      %388 : Float(128)
      %389 : Long()
      %390 : Float(32, 128, 3, 3)
      %391 : Float(672)
      %392 : Float(672)
      %393 : Float(672)
      %394 : Float(672)
      %395 : Long()
      %396 : Float(128, 672, 1, 1)
      %397 : Float(128)
      %398 : Float(128)
      %399 : Float(128)
      %400 : Float(128)
      %401 : Long()
      %402 : Float(32, 128, 3, 3)
      %403 : Float(704)
      %404 : Float(704)
      %405 : Float(704)
      %406 : Float(704)
      %407 : Long()
      %408 : Float(128, 704, 1, 1)
      %409 : Float(128)
      %410 : Float(128)
      %411 : Float(128)
      %412 : Float(128)
      %413 : Long()
      %414 : Float(32, 128, 3, 3)
      %415 : Float(736)
      %416 : Float(736)
      %417 : Float(736)
      %418 : Float(736)
      %419 : Long()
      %420 : Float(128, 736, 1, 1)
      %421 : Float(128)
      %422 : Float(128)
      %423 : Float(128)
      %424 : Float(128)
      %425 : Long()
      %426 : Float(32, 128, 3, 3)
      %427 : Float(768)
      %428 : Float(768)
      %429 : Float(768)
      %430 : Float(768)
      %431 : Long()
      %432 : Float(128, 768, 1, 1)
      %433 : Float(128)
      %434 : Float(128)
      %435 : Float(128)
      %436 : Float(128)
      %437 : Long()
      %438 : Float(32, 128, 3, 3)
      %439 : Float(800)
      %440 : Float(800)
      %441 : Float(800)
      %442 : Float(800)
      %443 : Long()
      %444 : Float(128, 800, 1, 1)
      %445 : Float(128)
      %446 : Float(128)
      %447 : Float(128)
      %448 : Float(128)
      %449 : Long()
      %450 : Float(32, 128, 3, 3)
      %451 : Float(832)
      %452 : Float(832)
      %453 : Float(832)
      %454 : Float(832)
      %455 : Long()
      %456 : Float(128, 832, 1, 1)
      %457 : Float(128)
      %458 : Float(128)
      %459 : Float(128)
      %460 : Float(128)
      %461 : Long()
      %462 : Float(32, 128, 3, 3)
      %463 : Float(864)
      %464 : Float(864)
      %465 : Float(864)
      %466 : Float(864)
      %467 : Long()
      %468 : Float(128, 864, 1, 1)
      %469 : Float(128)
      %470 : Float(128)
      %471 : Float(128)
      %472 : Float(128)
      %473 : Long()
      %474 : Float(32, 128, 3, 3)
      %475 : Float(896)
      %476 : Float(896)
      %477 : Float(896)
      %478 : Float(896)
      %479 : Long()
      %480 : Float(128, 896, 1, 1)
      %481 : Float(128)
      %482 : Float(128)
      %483 : Float(128)
      %484 : Float(128)
      %485 : Long()
      %486 : Float(32, 128, 3, 3)
      %487 : Float(928)
      %488 : Float(928)
      %489 : Float(928)
      %490 : Float(928)
      %491 : Long()
      %492 : Float(128, 928, 1, 1)
      %493 : Float(128)
      %494 : Float(128)
      %495 : Float(128)
      %496 : Float(128)
      %497 : Long()
      %498 : Float(32, 128, 3, 3)
      %499 : Float(960)
      %500 : Float(960)
      %501 : Float(960)
      %502 : Float(960)
      %503 : Long()
      %504 : Float(128, 960, 1, 1)
      %505 : Float(128)
      %506 : Float(128)
      %507 : Float(128)
      %508 : Float(128)
      %509 : Long()
      %510 : Float(32, 128, 3, 3)
      %511 : Float(992)
      %512 : Float(992)
      %513 : Float(992)
      %514 : Float(992)
      %515 : Long()
      %516 : Float(128, 992, 1, 1)
      %517 : Float(128)
      %518 : Float(128)
      %519 : Float(128)
      %520 : Float(128)
      %521 : Long()
      %522 : Float(32, 128, 3, 3)
      %523 : Float(1024)
      %524 : Float(1024)
      %525 : Float(1024)
      %526 : Float(1024)
      %527 : Long()
      %528 : Float(512, 1024, 1, 1)
      %529 : Float(512)
      %530 : Float(512)
      %531 : Float(512)
      %532 : Float(512)
      %533 : Long()
      %534 : Float(128, 512, 1, 1)
      %535 : Float(128)
      %536 : Float(128)
      %537 : Float(128)
      %538 : Float(128)
      %539 : Long()
      %540 : Float(32, 128, 3, 3)
      %541 : Float(544)
      %542 : Float(544)
      %543 : Float(544)
      %544 : Float(544)
      %545 : Long()
      %546 : Float(128, 544, 1, 1)
      %547 : Float(128)
      %548 : Float(128)
      %549 : Float(128)
      %550 : Float(128)
      %551 : Long()
      %552 : Float(32, 128, 3, 3)
      %553 : Float(576)
      %554 : Float(576)
      %555 : Float(576)
      %556 : Float(576)
      %557 : Long()
      %558 : Float(128, 576, 1, 1)
      %559 : Float(128)
      %560 : Float(128)
      %561 : Float(128)
      %562 : Float(128)
      %563 : Long()
      %564 : Float(32, 128, 3, 3)
      %565 : Float(608)
      %566 : Float(608)
      %567 : Float(608)
      %568 : Float(608)
      %569 : Long()
      %570 : Float(128, 608, 1, 1)
      %571 : Float(128)
      %572 : Float(128)
      %573 : Float(128)
      %574 : Float(128)
      %575 : Long()
      %576 : Float(32, 128, 3, 3)
      %577 : Float(640)
      %578 : Float(640)
      %579 : Float(640)
      %580 : Float(640)
      %581 : Long()
      %582 : Float(128, 640, 1, 1)
      %583 : Float(128)
      %584 : Float(128)
      %585 : Float(128)
      %586 : Float(128)
      %587 : Long()
      %588 : Float(32, 128, 3, 3)
      %589 : Float(672)
      %590 : Float(672)
      %591 : Float(672)
      %592 : Float(672)
      %593 : Long()
      %594 : Float(128, 672, 1, 1)
      %595 : Float(128)
      %596 : Float(128)
      %597 : Float(128)
      %598 : Float(128)
      %599 : Long()
      %600 : Float(32, 128, 3, 3)
      %601 : Float(704)
      %602 : Float(704)
      %603 : Float(704)
      %604 : Float(704)
      %605 : Long()
      %606 : Float(128, 704, 1, 1)
      %607 : Float(128)
      %608 : Float(128)
      %609 : Float(128)
      %610 : Float(128)
      %611 : Long()
      %612 : Float(32, 128, 3, 3)
      %613 : Float(736)
      %614 : Float(736)
      %615 : Float(736)
      %616 : Float(736)
      %617 : Long()
      %618 : Float(128, 736, 1, 1)
      %619 : Float(128)
      %620 : Float(128)
      %621 : Float(128)
      %622 : Float(128)
      %623 : Long()
      %624 : Float(32, 128, 3, 3)
      %625 : Float(768)
      %626 : Float(768)
      %627 : Float(768)
      %628 : Float(768)
      %629 : Long()
      %630 : Float(128, 768, 1, 1)
      %631 : Float(128)
      %632 : Float(128)
      %633 : Float(128)
      %634 : Float(128)
      %635 : Long()
      %636 : Float(32, 128, 3, 3)
      %637 : Float(800)
      %638 : Float(800)
      %639 : Float(800)
      %640 : Float(800)
      %641 : Long()
      %642 : Float(128, 800, 1, 1)
      %643 : Float(128)
      %644 : Float(128)
      %645 : Float(128)
      %646 : Float(128)
      %647 : Long()
      %648 : Float(32, 128, 3, 3)
      %649 : Float(832)
      %650 : Float(832)
      %651 : Float(832)
      %652 : Float(832)
      %653 : Long()
      %654 : Float(128, 832, 1, 1)
      %655 : Float(128)
      %656 : Float(128)
      %657 : Float(128)
      %658 : Float(128)
      %659 : Long()
      %660 : Float(32, 128, 3, 3)
      %661 : Float(864)
      %662 : Float(864)
      %663 : Float(864)
      %664 : Float(864)
      %665 : Long()
      %666 : Float(128, 864, 1, 1)
      %667 : Float(128)
      %668 : Float(128)
      %669 : Float(128)
      %670 : Float(128)
      %671 : Long()
      %672 : Float(32, 128, 3, 3)
      %673 : Float(896)
      %674 : Float(896)
      %675 : Float(896)
      %676 : Float(896)
      %677 : Long()
      %678 : Float(128, 896, 1, 1)
      %679 : Float(128)
      %680 : Float(128)
      %681 : Float(128)
      %682 : Float(128)
      %683 : Long()
      %684 : Float(32, 128, 3, 3)
      %685 : Float(928)
      %686 : Float(928)
      %687 : Float(928)
      %688 : Float(928)
      %689 : Long()
      %690 : Float(128, 928, 1, 1)
      %691 : Float(128)
      %692 : Float(128)
      %693 : Float(128)
      %694 : Float(128)
      %695 : Long()
      %696 : Float(32, 128, 3, 3)
      %697 : Float(960)
      %698 : Float(960)
      %699 : Float(960)
      %700 : Float(960)
      %701 : Long()
      %702 : Float(128, 960, 1, 1)
      %703 : Float(128)
      %704 : Float(128)
      %705 : Float(128)
      %706 : Float(128)
      %707 : Long()
      %708 : Float(32, 128, 3, 3)
      %709 : Float(992)
      %710 : Float(992)
      %711 : Float(992)
      %712 : Float(992)
      %713 : Long()
      %714 : Float(128, 992, 1, 1)
      %715 : Float(128)
      %716 : Float(128)
      %717 : Float(128)
      %718 : Float(128)
      %719 : Long()
      %720 : Float(32, 128, 3, 3)
      %721 : Float(1024)
      %722 : Float(1024)
      %723 : Float(1024)
      %724 : Float(1024)
      %725 : Long()
      %726 : Float(1000, 1024)
      %727 : Float(1000)) {
  %728 : Tensor = prim::Undefined(), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %729 : int = prim::Constant[value=2](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %730 : int = prim::Constant[value=2](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %731 : int[] = prim::ListConstruct(%729, %730), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %732 : int = prim::Constant[value=3](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %733 : int = prim::Constant[value=3](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %734 : int[] = prim::ListConstruct(%732, %733), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %735 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %736 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %737 : int[] = prim::ListConstruct(%735, %736), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %738 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %739 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %740 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %741 : int[] = prim::ListConstruct(%739, %740), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %742 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %743 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %744 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %745 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %input.1 : Float(10, 64, 112, 112) = aten::_convolution(%0, %1, %728, %731, %734, %737, %738, %741, %742, %743, %744, %745), scope: DenseNet/Sequential[features]/Conv2d[conv0]
  %747 : Long() = prim::Constant[value={1}](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %748 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %749 : Long() = aten::add_(%6, %747, %748), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %750 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %751 : int = aten::size(%input.1, %750), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %752 : Long() = prim::NumToTensor(%751), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %753 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %754 : int = aten::size(%input.1, %753), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %755 : Long() = prim::NumToTensor(%754), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %756 : int = prim::Constant[value=2](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %757 : int = aten::size(%input.1, %756), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %758 : Long() = prim::NumToTensor(%757), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %759 : int = prim::Constant[value=3](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %760 : int = aten::size(%input.1, %759), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %761 : Long() = prim::NumToTensor(%760), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %762 : Long() = aten::mul_(%752, %758), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %763 : Long() = aten::mul_(%762, %761), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %764 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %765 : Byte() = aten::eq(%763, %764), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %766 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %767 : float = prim::Constant[value=0.1](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %768 : float = prim::Constant[value=1e-05](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %769 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %input.2 : Float(10, 64, 112, 112) = aten::batch_norm(%input.1, %2, %3, %4, %5, %766, %767, %768, %769), scope: DenseNet/Sequential[features]/BatchNorm2d[norm0]
  %771 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/ReLU[relu0]
  %772 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/ReLU[relu0]
  %input.3 : Float(10, 64, 112, 112) = aten::threshold_(%input.2, %771, %772), scope: DenseNet/Sequential[features]/ReLU[relu0]
  %774 : int = prim::Constant[value=3](), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %775 : int = prim::Constant[value=3](), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %776 : int[] = prim::ListConstruct(%774, %775), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %777 : int = prim::Constant[value=2](), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %778 : int = prim::Constant[value=2](), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %779 : int[] = prim::ListConstruct(%777, %778), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %780 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %781 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %782 : int[] = prim::ListConstruct(%780, %781), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %783 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %784 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %785 : int[] = prim::ListConstruct(%783, %784), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %786 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %input.4 : Float(10, 64, 56, 56), %788 : Long(10, 64, 56, 56) = aten::max_pool2d_with_indices(%input.3, %776, %779, %782, %785, %786), scope: DenseNet/Sequential[features]/MaxPool2d[pool0]
  %789 : Long() = prim::Constant[value={1}](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %790 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %791 : Long() = aten::add_(%11, %789, %790), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %792 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %793 : int = aten::size(%input.4, %792), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %794 : Long() = prim::NumToTensor(%793), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %795 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %796 : int = aten::size(%input.4, %795), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %797 : Long() = prim::NumToTensor(%796), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %798 : int = prim::Constant[value=2](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %799 : int = aten::size(%input.4, %798), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %800 : Long() = prim::NumToTensor(%799), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %801 : int = prim::Constant[value=3](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %802 : int = aten::size(%input.4, %801), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %803 : Long() = prim::NumToTensor(%802), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %804 : Long() = aten::mul_(%794, %800), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %805 : Long() = aten::mul_(%804, %803), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %806 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %807 : Byte() = aten::eq(%805, %806), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %808 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %809 : float = prim::Constant[value=0.1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %810 : float = prim::Constant[value=1e-05](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %811 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %input.5 : Float(10, 64, 56, 56) = aten::batch_norm(%input.4, %7, %8, %9, %10, %808, %809, %810, %811), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm1]
  %813 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/ReLU[relu1]
  %814 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/ReLU[relu1]
  %815 : Float(10, 64, 56, 56) = aten::threshold_(%input.5, %813, %814), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/ReLU[relu1]
  %816 : Tensor = prim::Undefined(), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %817 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %818 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %819 : int[] = prim::ListConstruct(%817, %818), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %820 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %821 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %822 : int[] = prim::ListConstruct(%820, %821), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %823 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %824 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %825 : int[] = prim::ListConstruct(%823, %824), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %826 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %827 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %828 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %829 : int[] = prim::ListConstruct(%827, %828), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %830 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %831 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %832 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %833 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %input.6 : Float(10, 128, 56, 56) = aten::_convolution(%815, %12, %816, %819, %822, %825, %826, %829, %830, %831, %832, %833), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv1]
  %835 : Long() = prim::Constant[value={1}](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %836 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %837 : Long() = aten::add_(%17, %835, %836), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %838 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %839 : int = aten::size(%input.6, %838), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %840 : Long() = prim::NumToTensor(%839), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %841 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %842 : int = aten::size(%input.6, %841), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %843 : Long() = prim::NumToTensor(%842), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %844 : int = prim::Constant[value=2](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %845 : int = aten::size(%input.6, %844), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %846 : Long() = prim::NumToTensor(%845), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %847 : int = prim::Constant[value=3](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %848 : int = aten::size(%input.6, %847), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %849 : Long() = prim::NumToTensor(%848), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %850 : Long() = aten::mul_(%840, %846), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %851 : Long() = aten::mul_(%850, %849), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %852 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %853 : Byte() = aten::eq(%851, %852), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %854 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %855 : float = prim::Constant[value=0.1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %856 : float = prim::Constant[value=1e-05](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %857 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %input.7 : Float(10, 128, 56, 56) = aten::batch_norm(%input.6, %13, %14, %15, %16, %854, %855, %856, %857), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/BatchNorm2d[norm2]
  %859 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/ReLU[relu2]
  %860 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/ReLU[relu2]
  %861 : Float(10, 128, 56, 56) = aten::threshold_(%input.7, %859, %860), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/ReLU[relu2]
  %862 : Tensor = prim::Undefined(), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %863 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %864 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %865 : int[] = prim::ListConstruct(%863, %864), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %866 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %867 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %868 : int[] = prim::ListConstruct(%866, %867), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %869 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %870 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %871 : int[] = prim::ListConstruct(%869, %870), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %872 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %873 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %874 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %875 : int[] = prim::ListConstruct(%873, %874), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %876 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %877 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %878 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %879 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %880 : Float(10, 32, 56, 56) = aten::_convolution(%861, %18, %862, %865, %868, %871, %872, %875, %876, %877, %878, %879), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]/Conv2d[conv2]
  %881 : Tensor[] = prim::ListConstruct(%input.4, %880), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]
  %882 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]
  %input.8 : Float(10, 96, 56, 56) = aten::cat(%881, %882), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer1]
  %884 : Long() = prim::Constant[value={1}](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %885 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %886 : Long() = aten::add_(%23, %884, %885), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %887 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %888 : int = aten::size(%input.8, %887), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %889 : Long() = prim::NumToTensor(%888), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %890 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %891 : int = aten::size(%input.8, %890), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %892 : Long() = prim::NumToTensor(%891), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %893 : int = prim::Constant[value=2](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %894 : int = aten::size(%input.8, %893), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %895 : Long() = prim::NumToTensor(%894), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %896 : int = prim::Constant[value=3](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %897 : int = aten::size(%input.8, %896), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %898 : Long() = prim::NumToTensor(%897), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %899 : Long() = aten::mul_(%889, %895), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %900 : Long() = aten::mul_(%899, %898), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %901 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %902 : Byte() = aten::eq(%900, %901), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %903 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %904 : float = prim::Constant[value=0.1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %905 : float = prim::Constant[value=1e-05](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %906 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %input.9 : Float(10, 96, 56, 56) = aten::batch_norm(%input.8, %19, %20, %21, %22, %903, %904, %905, %906), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm1]
  %908 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/ReLU[relu1]
  %909 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/ReLU[relu1]
  %910 : Float(10, 96, 56, 56) = aten::threshold_(%input.9, %908, %909), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/ReLU[relu1]
  %911 : Tensor = prim::Undefined(), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %912 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %913 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %914 : int[] = prim::ListConstruct(%912, %913), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %915 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %916 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %917 : int[] = prim::ListConstruct(%915, %916), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %918 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %919 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %920 : int[] = prim::ListConstruct(%918, %919), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %921 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %922 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %923 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %924 : int[] = prim::ListConstruct(%922, %923), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %925 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %926 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %927 : bool = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %928 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %input.10 : Float(10, 128, 56, 56) = aten::_convolution(%910, %24, %911, %914, %917, %920, %921, %924, %925, %926, %927, %928), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv1]
  %930 : Long() = prim::Constant[value={1}](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %931 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %932 : Long() = aten::add_(%29, %930, %931), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %933 : int = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %934 : int = aten::size(%input.10, %933), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %935 : Long() = prim::NumToTensor(%934), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %936 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %937 : int = aten::size(%input.10, %936), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %938 : Long() = prim::NumToTensor(%937), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %939 : int = prim::Constant[value=2](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %940 : int = aten::size(%input.10, %939), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %941 : Long() = prim::NumToTensor(%940), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %942 : int = prim::Constant[value=3](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %943 : int = aten::size(%input.10, %942), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %944 : Long() = prim::NumToTensor(%943), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %945 : Long() = aten::mul_(%935, %941), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %946 : Long() = aten::mul_(%945, %944), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %947 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %948 : Byte() = aten::eq(%946, %947), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %949 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %950 : float = prim::Constant[value=0.1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %951 : float = prim::Constant[value=1e-05](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %952 : bool = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %input.11 : Float(10, 128, 56, 56) = aten::batch_norm(%input.10, %25, %26, %27, %28, %949, %950, %951, %952), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/BatchNorm2d[norm2]
  %954 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/ReLU[relu2]
  %955 : float = prim::Constant[value=0](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/ReLU[relu2]
  %956 : Float(10, 128, 56, 56) = aten::threshold_(%input.11, %954, %955), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/ReLU[relu2]
  %957 : Tensor = prim::Undefined(), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv2]
  %958 : int = prim::Constant[value=1](), scope: DenseNet/Sequential[features]/_DenseBlock[denseblock1]/_DenseLayer[denselayer2]/Conv2d[conv2]
