graph(%0 : Float(10, 3, 299, 299)
      %1 : Float(32, 3, 3, 3)
      %2 : Float(32)
      %3 : Float(32)
      %4 : Float(32)
      %5 : Float(32)
      %6 : Long()
      %7 : Float(32, 32, 3, 3)
      %8 : Float(32)
      %9 : Float(32)
      %10 : Float(32)
      %11 : Float(32)
      %12 : Long()
      %13 : Float(64, 32, 3, 3)
      %14 : Float(64)
      %15 : Float(64)
      %16 : Float(64)
      %17 : Float(64)
      %18 : Long()
      %19 : Float(80, 64, 1, 1)
      %20 : Float(80)
      %21 : Float(80)
      %22 : Float(80)
      %23 : Float(80)
      %24 : Long()
      %25 : Float(192, 80, 3, 3)
      %26 : Float(192)
      %27 : Float(192)
      %28 : Float(192)
      %29 : Float(192)
      %30 : Long()
      %31 : Float(64, 192, 1, 1)
      %32 : Float(64)
      %33 : Float(64)
      %34 : Float(64)
      %35 : Float(64)
      %36 : Long()
      %37 : Float(48, 192, 1, 1)
      %38 : Float(48)
      %39 : Float(48)
      %40 : Float(48)
      %41 : Float(48)
      %42 : Long()
      %43 : Float(64, 48, 5, 5)
      %44 : Float(64)
      %45 : Float(64)
      %46 : Float(64)
      %47 : Float(64)
      %48 : Long()
      %49 : Float(64, 192, 1, 1)
      %50 : Float(64)
      %51 : Float(64)
      %52 : Float(64)
      %53 : Float(64)
      %54 : Long()
      %55 : Float(96, 64, 3, 3)
      %56 : Float(96)
      %57 : Float(96)
      %58 : Float(96)
      %59 : Float(96)
      %60 : Long()
      %61 : Float(96, 96, 3, 3)
      %62 : Float(96)
      %63 : Float(96)
      %64 : Float(96)
      %65 : Float(96)
      %66 : Long()
      %67 : Float(32, 192, 1, 1)
      %68 : Float(32)
      %69 : Float(32)
      %70 : Float(32)
      %71 : Float(32)
      %72 : Long()
      %73 : Float(64, 256, 1, 1)
      %74 : Float(64)
      %75 : Float(64)
      %76 : Float(64)
      %77 : Float(64)
      %78 : Long()
      %79 : Float(48, 256, 1, 1)
      %80 : Float(48)
      %81 : Float(48)
      %82 : Float(48)
      %83 : Float(48)
      %84 : Long()
      %85 : Float(64, 48, 5, 5)
      %86 : Float(64)
      %87 : Float(64)
      %88 : Float(64)
      %89 : Float(64)
      %90 : Long()
      %91 : Float(64, 256, 1, 1)
      %92 : Float(64)
      %93 : Float(64)
      %94 : Float(64)
      %95 : Float(64)
      %96 : Long()
      %97 : Float(96, 64, 3, 3)
      %98 : Float(96)
      %99 : Float(96)
      %100 : Float(96)
      %101 : Float(96)
      %102 : Long()
      %103 : Float(96, 96, 3, 3)
      %104 : Float(96)
      %105 : Float(96)
      %106 : Float(96)
      %107 : Float(96)
      %108 : Long()
      %109 : Float(64, 256, 1, 1)
      %110 : Float(64)
      %111 : Float(64)
      %112 : Float(64)
      %113 : Float(64)
      %114 : Long()
      %115 : Float(64, 288, 1, 1)
      %116 : Float(64)
      %117 : Float(64)
      %118 : Float(64)
      %119 : Float(64)
      %120 : Long()
      %121 : Float(48, 288, 1, 1)
      %122 : Float(48)
      %123 : Float(48)
      %124 : Float(48)
      %125 : Float(48)
      %126 : Long()
      %127 : Float(64, 48, 5, 5)
      %128 : Float(64)
      %129 : Float(64)
      %130 : Float(64)
      %131 : Float(64)
      %132 : Long()
      %133 : Float(64, 288, 1, 1)
      %134 : Float(64)
      %135 : Float(64)
      %136 : Float(64)
      %137 : Float(64)
      %138 : Long()
      %139 : Float(96, 64, 3, 3)
      %140 : Float(96)
      %141 : Float(96)
      %142 : Float(96)
      %143 : Float(96)
      %144 : Long()
      %145 : Float(96, 96, 3, 3)
      %146 : Float(96)
      %147 : Float(96)
      %148 : Float(96)
      %149 : Float(96)
      %150 : Long()
      %151 : Float(64, 288, 1, 1)
      %152 : Float(64)
      %153 : Float(64)
      %154 : Float(64)
      %155 : Float(64)
      %156 : Long()
      %157 : Float(384, 288, 3, 3)
      %158 : Float(384)
      %159 : Float(384)
      %160 : Float(384)
      %161 : Float(384)
      %162 : Long()
      %163 : Float(64, 288, 1, 1)
      %164 : Float(64)
      %165 : Float(64)
      %166 : Float(64)
      %167 : Float(64)
      %168 : Long()
      %169 : Float(96, 64, 3, 3)
      %170 : Float(96)
      %171 : Float(96)
      %172 : Float(96)
      %173 : Float(96)
      %174 : Long()
      %175 : Float(96, 96, 3, 3)
      %176 : Float(96)
      %177 : Float(96)
      %178 : Float(96)
      %179 : Float(96)
      %180 : Long()
      %181 : Float(192, 768, 1, 1)
      %182 : Float(192)
      %183 : Float(192)
      %184 : Float(192)
      %185 : Float(192)
      %186 : Long()
      %187 : Float(128, 768, 1, 1)
      %188 : Float(128)
      %189 : Float(128)
      %190 : Float(128)
      %191 : Float(128)
      %192 : Long()
      %193 : Float(128, 128, 1, 7)
      %194 : Float(128)
      %195 : Float(128)
      %196 : Float(128)
      %197 : Float(128)
      %198 : Long()
      %199 : Float(192, 128, 7, 1)
      %200 : Float(192)
      %201 : Float(192)
      %202 : Float(192)
      %203 : Float(192)
      %204 : Long()
      %205 : Float(128, 768, 1, 1)
      %206 : Float(128)
      %207 : Float(128)
      %208 : Float(128)
      %209 : Float(128)
      %210 : Long()
      %211 : Float(128, 128, 7, 1)
      %212 : Float(128)
      %213 : Float(128)
      %214 : Float(128)
      %215 : Float(128)
      %216 : Long()
      %217 : Float(128, 128, 1, 7)
      %218 : Float(128)
      %219 : Float(128)
      %220 : Float(128)
      %221 : Float(128)
      %222 : Long()
      %223 : Float(128, 128, 7, 1)
      %224 : Float(128)
      %225 : Float(128)
      %226 : Float(128)
      %227 : Float(128)
      %228 : Long()
      %229 : Float(192, 128, 1, 7)
      %230 : Float(192)
      %231 : Float(192)
      %232 : Float(192)
      %233 : Float(192)
      %234 : Long()
      %235 : Float(192, 768, 1, 1)
      %236 : Float(192)
      %237 : Float(192)
      %238 : Float(192)
      %239 : Float(192)
      %240 : Long()
      %241 : Float(192, 768, 1, 1)
      %242 : Float(192)
      %243 : Float(192)
      %244 : Float(192)
      %245 : Float(192)
      %246 : Long()
      %247 : Float(160, 768, 1, 1)
      %248 : Float(160)
      %249 : Float(160)
      %250 : Float(160)
      %251 : Float(160)
      %252 : Long()
      %253 : Float(160, 160, 1, 7)
      %254 : Float(160)
      %255 : Float(160)
      %256 : Float(160)
      %257 : Float(160)
      %258 : Long()
      %259 : Float(192, 160, 7, 1)
      %260 : Float(192)
      %261 : Float(192)
      %262 : Float(192)
      %263 : Float(192)
      %264 : Long()
      %265 : Float(160, 768, 1, 1)
      %266 : Float(160)
      %267 : Float(160)
      %268 : Float(160)
      %269 : Float(160)
      %270 : Long()
      %271 : Float(160, 160, 7, 1)
      %272 : Float(160)
      %273 : Float(160)
      %274 : Float(160)
      %275 : Float(160)
      %276 : Long()
      %277 : Float(160, 160, 1, 7)
      %278 : Float(160)
      %279 : Float(160)
      %280 : Float(160)
      %281 : Float(160)
      %282 : Long()
      %283 : Float(160, 160, 7, 1)
      %284 : Float(160)
      %285 : Float(160)
      %286 : Float(160)
      %287 : Float(160)
      %288 : Long()
      %289 : Float(192, 160, 1, 7)
      %290 : Float(192)
      %291 : Float(192)
      %292 : Float(192)
      %293 : Float(192)
      %294 : Long()
      %295 : Float(192, 768, 1, 1)
      %296 : Float(192)
      %297 : Float(192)
      %298 : Float(192)
      %299 : Float(192)
      %300 : Long()
      %301 : Float(192, 768, 1, 1)
      %302 : Float(192)
      %303 : Float(192)
      %304 : Float(192)
      %305 : Float(192)
      %306 : Long()
      %307 : Float(160, 768, 1, 1)
      %308 : Float(160)
      %309 : Float(160)
      %310 : Float(160)
      %311 : Float(160)
      %312 : Long()
      %313 : Float(160, 160, 1, 7)
      %314 : Float(160)
      %315 : Float(160)
      %316 : Float(160)
      %317 : Float(160)
      %318 : Long()
      %319 : Float(192, 160, 7, 1)
      %320 : Float(192)
      %321 : Float(192)
      %322 : Float(192)
      %323 : Float(192)
      %324 : Long()
      %325 : Float(160, 768, 1, 1)
      %326 : Float(160)
      %327 : Float(160)
      %328 : Float(160)
      %329 : Float(160)
      %330 : Long()
      %331 : Float(160, 160, 7, 1)
      %332 : Float(160)
      %333 : Float(160)
      %334 : Float(160)
      %335 : Float(160)
      %336 : Long()
      %337 : Float(160, 160, 1, 7)
      %338 : Float(160)
      %339 : Float(160)
      %340 : Float(160)
      %341 : Float(160)
      %342 : Long()
      %343 : Float(160, 160, 7, 1)
      %344 : Float(160)
      %345 : Float(160)
      %346 : Float(160)
      %347 : Float(160)
      %348 : Long()
      %349 : Float(192, 160, 1, 7)
      %350 : Float(192)
      %351 : Float(192)
      %352 : Float(192)
      %353 : Float(192)
      %354 : Long()
      %355 : Float(192, 768, 1, 1)
      %356 : Float(192)
      %357 : Float(192)
      %358 : Float(192)
      %359 : Float(192)
      %360 : Long()
      %361 : Float(192, 768, 1, 1)
      %362 : Float(192)
      %363 : Float(192)
      %364 : Float(192)
      %365 : Float(192)
      %366 : Long()
      %367 : Float(192, 768, 1, 1)
      %368 : Float(192)
      %369 : Float(192)
      %370 : Float(192)
      %371 : Float(192)
      %372 : Long()
      %373 : Float(192, 192, 1, 7)
      %374 : Float(192)
      %375 : Float(192)
      %376 : Float(192)
      %377 : Float(192)
      %378 : Long()
      %379 : Float(192, 192, 7, 1)
      %380 : Float(192)
      %381 : Float(192)
      %382 : Float(192)
      %383 : Float(192)
      %384 : Long()
      %385 : Float(192, 768, 1, 1)
      %386 : Float(192)
      %387 : Float(192)
      %388 : Float(192)
      %389 : Float(192)
      %390 : Long()
      %391 : Float(192, 192, 7, 1)
      %392 : Float(192)
      %393 : Float(192)
      %394 : Float(192)
      %395 : Float(192)
      %396 : Long()
      %397 : Float(192, 192, 1, 7)
      %398 : Float(192)
      %399 : Float(192)
      %400 : Float(192)
      %401 : Float(192)
      %402 : Long()
      %403 : Float(192, 192, 7, 1)
      %404 : Float(192)
      %405 : Float(192)
      %406 : Float(192)
      %407 : Float(192)
      %408 : Long()
      %409 : Float(192, 192, 1, 7)
      %410 : Float(192)
      %411 : Float(192)
      %412 : Float(192)
      %413 : Float(192)
      %414 : Long()
      %415 : Float(192, 768, 1, 1)
      %416 : Float(192)
      %417 : Float(192)
      %418 : Float(192)
      %419 : Float(192)
      %420 : Long()
      %421 : Float(128, 768, 1, 1)
      %422 : Float(128)
      %423 : Float(128)
      %424 : Float(128)
      %425 : Float(128)
      %426 : Long()
      %427 : Float(768, 128, 5, 5)
      %428 : Float(768)
      %429 : Float(768)
      %430 : Float(768)
      %431 : Float(768)
      %432 : Long()
      %433 : Float(1000, 768)
      %434 : Float(1000)
      %435 : Float(192, 768, 1, 1)
      %436 : Float(192)
      %437 : Float(192)
      %438 : Float(192)
      %439 : Float(192)
      %440 : Long()
      %441 : Float(320, 192, 3, 3)
      %442 : Float(320)
      %443 : Float(320)
      %444 : Float(320)
      %445 : Float(320)
      %446 : Long()
      %447 : Float(192, 768, 1, 1)
      %448 : Float(192)
      %449 : Float(192)
      %450 : Float(192)
      %451 : Float(192)
      %452 : Long()
      %453 : Float(192, 192, 1, 7)
      %454 : Float(192)
      %455 : Float(192)
      %456 : Float(192)
      %457 : Float(192)
      %458 : Long()
      %459 : Float(192, 192, 7, 1)
      %460 : Float(192)
      %461 : Float(192)
      %462 : Float(192)
      %463 : Float(192)
      %464 : Long()
      %465 : Float(192, 192, 3, 3)
      %466 : Float(192)
      %467 : Float(192)
      %468 : Float(192)
      %469 : Float(192)
      %470 : Long()
      %471 : Float(320, 1280, 1, 1)
      %472 : Float(320)
      %473 : Float(320)
      %474 : Float(320)
      %475 : Float(320)
      %476 : Long()
      %477 : Float(384, 1280, 1, 1)
      %478 : Float(384)
      %479 : Float(384)
      %480 : Float(384)
      %481 : Float(384)
      %482 : Long()
      %483 : Float(384, 384, 1, 3)
      %484 : Float(384)
      %485 : Float(384)
      %486 : Float(384)
      %487 : Float(384)
      %488 : Long()
      %489 : Float(384, 384, 3, 1)
      %490 : Float(384)
      %491 : Float(384)
      %492 : Float(384)
      %493 : Float(384)
      %494 : Long()
      %495 : Float(448, 1280, 1, 1)
      %496 : Float(448)
      %497 : Float(448)
      %498 : Float(448)
      %499 : Float(448)
      %500 : Long()
      %501 : Float(384, 448, 3, 3)
      %502 : Float(384)
      %503 : Float(384)
      %504 : Float(384)
      %505 : Float(384)
      %506 : Long()
      %507 : Float(384, 384, 1, 3)
      %508 : Float(384)
      %509 : Float(384)
      %510 : Float(384)
      %511 : Float(384)
      %512 : Long()
      %513 : Float(384, 384, 3, 1)
      %514 : Float(384)
      %515 : Float(384)
      %516 : Float(384)
      %517 : Float(384)
      %518 : Long()
      %519 : Float(192, 1280, 1, 1)
      %520 : Float(192)
      %521 : Float(192)
      %522 : Float(192)
      %523 : Float(192)
      %524 : Long()
      %525 : Float(320, 2048, 1, 1)
      %526 : Float(320)
      %527 : Float(320)
      %528 : Float(320)
      %529 : Float(320)
      %530 : Long()
      %531 : Float(384, 2048, 1, 1)
      %532 : Float(384)
      %533 : Float(384)
      %534 : Float(384)
      %535 : Float(384)
      %536 : Long()
      %537 : Float(384, 384, 1, 3)
      %538 : Float(384)
      %539 : Float(384)
      %540 : Float(384)
      %541 : Float(384)
      %542 : Long()
      %543 : Float(384, 384, 3, 1)
      %544 : Float(384)
      %545 : Float(384)
      %546 : Float(384)
      %547 : Float(384)
      %548 : Long()
      %549 : Float(448, 2048, 1, 1)
      %550 : Float(448)
      %551 : Float(448)
      %552 : Float(448)
      %553 : Float(448)
      %554 : Long()
      %555 : Float(384, 448, 3, 3)
      %556 : Float(384)
      %557 : Float(384)
      %558 : Float(384)
      %559 : Float(384)
      %560 : Long()
      %561 : Float(384, 384, 1, 3)
      %562 : Float(384)
      %563 : Float(384)
      %564 : Float(384)
      %565 : Float(384)
      %566 : Long()
      %567 : Float(384, 384, 3, 1)
      %568 : Float(384)
      %569 : Float(384)
      %570 : Float(384)
      %571 : Float(384)
      %572 : Long()
      %573 : Float(192, 2048, 1, 1)
      %574 : Float(192)
      %575 : Float(192)
      %576 : Float(192)
      %577 : Float(192)
      %578 : Long()
      %579 : Float(1000, 2048)
      %580 : Float(1000)) {
  %581 : Tensor = prim::Undefined(), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %582 : int = prim::Constant[value=2](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %583 : int = prim::Constant[value=2](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %584 : int[] = prim::ListConstruct(%582, %583), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %585 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %586 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %587 : int[] = prim::ListConstruct(%585, %586), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %588 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %589 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %590 : int[] = prim::ListConstruct(%588, %589), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %591 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %592 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %593 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %594 : int[] = prim::ListConstruct(%592, %593), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %595 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %596 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %597 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %598 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %input.1 : Float(10, 32, 149, 149) = aten::_convolution(%0, %1, %581, %584, %587, %590, %591, %594, %595, %596, %597, %598), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/Conv2d[conv]
  %600 : Long() = prim::Constant[value={1}](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %601 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %602 : Long() = aten::add_(%6, %600, %601), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %603 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %604 : int = aten::size(%input.1, %603), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %605 : Long() = prim::NumToTensor(%604), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %606 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %607 : int = aten::size(%input.1, %606), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %608 : Long() = prim::NumToTensor(%607), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %609 : int = prim::Constant[value=2](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %610 : int = aten::size(%input.1, %609), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %611 : Long() = prim::NumToTensor(%610), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %612 : int = prim::Constant[value=3](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %613 : int = aten::size(%input.1, %612), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %614 : Long() = prim::NumToTensor(%613), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %615 : Long() = aten::mul_(%605, %611), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %616 : Long() = aten::mul_(%615, %614), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %617 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %618 : Byte() = aten::eq(%616, %617), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %619 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %620 : float = prim::Constant[value=0.1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %621 : float = prim::Constant[value=0.001](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %622 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %x.1 : Float(10, 32, 149, 149) = aten::batch_norm(%input.1, %2, %3, %4, %5, %619, %620, %621, %622), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]/BatchNorm2d[bn]
  %624 : Float(10, 32, 149, 149) = aten::relu_(%x.1), scope: Inception3/BasicConv2d[Conv2d_1a_3x3]
  %625 : Tensor = prim::Undefined(), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %626 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %627 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %628 : int[] = prim::ListConstruct(%626, %627), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %629 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %630 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %631 : int[] = prim::ListConstruct(%629, %630), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %632 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %633 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %634 : int[] = prim::ListConstruct(%632, %633), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %635 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %636 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %637 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %638 : int[] = prim::ListConstruct(%636, %637), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %639 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %640 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %641 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %642 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %input.2 : Float(10, 32, 147, 147) = aten::_convolution(%624, %7, %625, %628, %631, %634, %635, %638, %639, %640, %641, %642), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/Conv2d[conv]
  %644 : Long() = prim::Constant[value={1}](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %645 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %646 : Long() = aten::add_(%12, %644, %645), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %647 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %648 : int = aten::size(%input.2, %647), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %649 : Long() = prim::NumToTensor(%648), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %650 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %651 : int = aten::size(%input.2, %650), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %652 : Long() = prim::NumToTensor(%651), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %653 : int = prim::Constant[value=2](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %654 : int = aten::size(%input.2, %653), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %655 : Long() = prim::NumToTensor(%654), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %656 : int = prim::Constant[value=3](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %657 : int = aten::size(%input.2, %656), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %658 : Long() = prim::NumToTensor(%657), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %659 : Long() = aten::mul_(%649, %655), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %660 : Long() = aten::mul_(%659, %658), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %661 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %662 : Byte() = aten::eq(%660, %661), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %663 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %664 : float = prim::Constant[value=0.1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %665 : float = prim::Constant[value=0.001](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %666 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %x.2 : Float(10, 32, 147, 147) = aten::batch_norm(%input.2, %8, %9, %10, %11, %663, %664, %665, %666), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]/BatchNorm2d[bn]
  %668 : Float(10, 32, 147, 147) = aten::relu_(%x.2), scope: Inception3/BasicConv2d[Conv2d_2a_3x3]
  %669 : Tensor = prim::Undefined(), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %670 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %671 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %672 : int[] = prim::ListConstruct(%670, %671), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %673 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %674 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %675 : int[] = prim::ListConstruct(%673, %674), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %676 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %677 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %678 : int[] = prim::ListConstruct(%676, %677), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %679 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %680 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %681 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %682 : int[] = prim::ListConstruct(%680, %681), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %683 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %684 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %685 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %686 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %input.3 : Float(10, 64, 147, 147) = aten::_convolution(%668, %13, %669, %672, %675, %678, %679, %682, %683, %684, %685, %686), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/Conv2d[conv]
  %688 : Long() = prim::Constant[value={1}](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %689 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %690 : Long() = aten::add_(%18, %688, %689), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %691 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %692 : int = aten::size(%input.3, %691), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %693 : Long() = prim::NumToTensor(%692), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %694 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %695 : int = aten::size(%input.3, %694), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %696 : Long() = prim::NumToTensor(%695), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %697 : int = prim::Constant[value=2](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %698 : int = aten::size(%input.3, %697), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %699 : Long() = prim::NumToTensor(%698), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %700 : int = prim::Constant[value=3](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %701 : int = aten::size(%input.3, %700), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %702 : Long() = prim::NumToTensor(%701), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %703 : Long() = aten::mul_(%693, %699), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %704 : Long() = aten::mul_(%703, %702), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %705 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %706 : Byte() = aten::eq(%704, %705), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %707 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %708 : float = prim::Constant[value=0.1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %709 : float = prim::Constant[value=0.001](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %710 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %x.3 : Float(10, 64, 147, 147) = aten::batch_norm(%input.3, %14, %15, %16, %17, %707, %708, %709, %710), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]/BatchNorm2d[bn]
  %input.4 : Float(10, 64, 147, 147) = aten::relu_(%x.3), scope: Inception3/BasicConv2d[Conv2d_2b_3x3]
  %713 : int = prim::Constant[value=3](), scope: Inception3
  %714 : int = prim::Constant[value=3](), scope: Inception3
  %715 : int[] = prim::ListConstruct(%713, %714), scope: Inception3
  %716 : int = prim::Constant[value=2](), scope: Inception3
  %717 : int = prim::Constant[value=2](), scope: Inception3
  %718 : int[] = prim::ListConstruct(%716, %717), scope: Inception3
  %719 : int = prim::Constant[value=0](), scope: Inception3
  %720 : int = prim::Constant[value=0](), scope: Inception3
  %721 : int[] = prim::ListConstruct(%719, %720), scope: Inception3
  %722 : int = prim::Constant[value=1](), scope: Inception3
  %723 : int = prim::Constant[value=1](), scope: Inception3
  %724 : int[] = prim::ListConstruct(%722, %723), scope: Inception3
  %725 : bool = prim::Constant[value=0](), scope: Inception3
  %726 : Float(10, 64, 73, 73), %727 : Long(10, 64, 73, 73) = aten::max_pool2d_with_indices(%input.4, %715, %718, %721, %724, %725), scope: Inception3
  %728 : Tensor = prim::Undefined(), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %729 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %730 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %731 : int[] = prim::ListConstruct(%729, %730), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %732 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %733 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %734 : int[] = prim::ListConstruct(%732, %733), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %735 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %736 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %737 : int[] = prim::ListConstruct(%735, %736), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %738 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %739 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %740 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %741 : int[] = prim::ListConstruct(%739, %740), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %742 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %743 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %744 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %745 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %input.5 : Float(10, 80, 73, 73) = aten::_convolution(%726, %19, %728, %731, %734, %737, %738, %741, %742, %743, %744, %745), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/Conv2d[conv]
  %747 : Long() = prim::Constant[value={1}](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %748 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %749 : Long() = aten::add_(%24, %747, %748), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %750 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %751 : int = aten::size(%input.5, %750), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %752 : Long() = prim::NumToTensor(%751), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %753 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %754 : int = aten::size(%input.5, %753), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %755 : Long() = prim::NumToTensor(%754), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %756 : int = prim::Constant[value=2](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %757 : int = aten::size(%input.5, %756), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %758 : Long() = prim::NumToTensor(%757), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %759 : int = prim::Constant[value=3](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %760 : int = aten::size(%input.5, %759), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %761 : Long() = prim::NumToTensor(%760), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %762 : Long() = aten::mul_(%752, %758), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %763 : Long() = aten::mul_(%762, %761), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %764 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %765 : Byte() = aten::eq(%763, %764), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %766 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %767 : float = prim::Constant[value=0.1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %768 : float = prim::Constant[value=0.001](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %769 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %x.4 : Float(10, 80, 73, 73) = aten::batch_norm(%input.5, %20, %21, %22, %23, %766, %767, %768, %769), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]/BatchNorm2d[bn]
  %771 : Float(10, 80, 73, 73) = aten::relu_(%x.4), scope: Inception3/BasicConv2d[Conv2d_3b_1x1]
  %772 : Tensor = prim::Undefined(), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %773 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %774 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %775 : int[] = prim::ListConstruct(%773, %774), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %776 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %777 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %778 : int[] = prim::ListConstruct(%776, %777), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %779 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %780 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %781 : int[] = prim::ListConstruct(%779, %780), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %782 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %783 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %784 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %785 : int[] = prim::ListConstruct(%783, %784), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %786 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %787 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %788 : bool = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %789 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %input.6 : Float(10, 192, 71, 71) = aten::_convolution(%771, %25, %772, %775, %778, %781, %782, %785, %786, %787, %788, %789), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/Conv2d[conv]
  %791 : Long() = prim::Constant[value={1}](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %792 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %793 : Long() = aten::add_(%30, %791, %792), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %794 : int = prim::Constant[value=0](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %795 : int = aten::size(%input.6, %794), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %796 : Long() = prim::NumToTensor(%795), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %797 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %798 : int = aten::size(%input.6, %797), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %799 : Long() = prim::NumToTensor(%798), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %800 : int = prim::Constant[value=2](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %801 : int = aten::size(%input.6, %800), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %802 : Long() = prim::NumToTensor(%801), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %803 : int = prim::Constant[value=3](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %804 : int = aten::size(%input.6, %803), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %805 : Long() = prim::NumToTensor(%804), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %806 : Long() = aten::mul_(%796, %802), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %807 : Long() = aten::mul_(%806, %805), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %808 : int = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %809 : Byte() = aten::eq(%807, %808), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %810 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %811 : float = prim::Constant[value=0.1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %812 : float = prim::Constant[value=0.001](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %813 : bool = prim::Constant[value=1](), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %x.5 : Float(10, 192, 71, 71) = aten::batch_norm(%input.6, %26, %27, %28, %29, %810, %811, %812, %813), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]/BatchNorm2d[bn]
  %input.7 : Float(10, 192, 71, 71) = aten::relu_(%x.5), scope: Inception3/BasicConv2d[Conv2d_4a_3x3]
  %816 : int = prim::Constant[value=3](), scope: Inception3
  %817 : int = prim::Constant[value=3](), scope: Inception3
  %818 : int[] = prim::ListConstruct(%816, %817), scope: Inception3
  %819 : int = prim::Constant[value=2](), scope: Inception3
  %820 : int = prim::Constant[value=2](), scope: Inception3
  %821 : int[] = prim::ListConstruct(%819, %820), scope: Inception3
  %822 : int = prim::Constant[value=0](), scope: Inception3
  %823 : int = prim::Constant[value=0](), scope: Inception3
  %824 : int[] = prim::ListConstruct(%822, %823), scope: Inception3
  %825 : int = prim::Constant[value=1](), scope: Inception3
  %826 : int = prim::Constant[value=1](), scope: Inception3
  %827 : int[] = prim::ListConstruct(%825, %826), scope: Inception3
  %828 : bool = prim::Constant[value=0](), scope: Inception3
  %829 : Float(10, 192, 35, 35), %830 : Long(10, 192, 35, 35) = aten::max_pool2d_with_indices(%input.7, %818, %821, %824, %827, %828), scope: Inception3
  %831 : Tensor = prim::Undefined(), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %832 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %833 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %834 : int[] = prim::ListConstruct(%832, %833), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %835 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %836 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %837 : int[] = prim::ListConstruct(%835, %836), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %838 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %839 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %840 : int[] = prim::ListConstruct(%838, %839), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %841 : bool = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %842 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %843 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %844 : int[] = prim::ListConstruct(%842, %843), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %845 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %846 : bool = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %847 : bool = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %848 : bool = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %input.8 : Float(10, 64, 35, 35) = aten::_convolution(%829, %31, %831, %834, %837, %840, %841, %844, %845, %846, %847, %848), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/Conv2d[conv]
  %850 : Long() = prim::Constant[value={1}](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %851 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %852 : Long() = aten::add_(%36, %850, %851), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %853 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %854 : int = aten::size(%input.8, %853), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %855 : Long() = prim::NumToTensor(%854), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %856 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %857 : int = aten::size(%input.8, %856), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %858 : Long() = prim::NumToTensor(%857), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %859 : int = prim::Constant[value=2](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %860 : int = aten::size(%input.8, %859), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %861 : Long() = prim::NumToTensor(%860), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %862 : int = prim::Constant[value=3](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %863 : int = aten::size(%input.8, %862), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %864 : Long() = prim::NumToTensor(%863), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %865 : Long() = aten::mul_(%855, %861), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %866 : Long() = aten::mul_(%865, %864), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %867 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %868 : Byte() = aten::eq(%866, %867), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %869 : bool = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %870 : float = prim::Constant[value=0.1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %871 : float = prim::Constant[value=0.001](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %872 : bool = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %x.6 : Float(10, 64, 35, 35) = aten::batch_norm(%input.8, %32, %33, %34, %35, %869, %870, %871, %872), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]/BatchNorm2d[bn]
  %874 : Float(10, 64, 35, 35) = aten::relu_(%x.6), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch1x1]
  %875 : Tensor = prim::Undefined(), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %876 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %877 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %878 : int[] = prim::ListConstruct(%876, %877), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %879 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %880 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %881 : int[] = prim::ListConstruct(%879, %880), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %882 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %883 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %884 : int[] = prim::ListConstruct(%882, %883), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %885 : bool = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %886 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %887 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %888 : int[] = prim::ListConstruct(%886, %887), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %889 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %890 : bool = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %891 : bool = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %892 : bool = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %input.9 : Float(10, 48, 35, 35) = aten::_convolution(%829, %37, %875, %878, %881, %884, %885, %888, %889, %890, %891, %892), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/Conv2d[conv]
  %894 : Long() = prim::Constant[value={1}](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %895 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %896 : Long() = aten::add_(%42, %894, %895), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %897 : int = prim::Constant[value=0](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %898 : int = aten::size(%input.9, %897), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %899 : Long() = prim::NumToTensor(%898), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %900 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %901 : int = aten::size(%input.9, %900), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %902 : Long() = prim::NumToTensor(%901), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %903 : int = prim::Constant[value=2](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %904 : int = aten::size(%input.9, %903), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %905 : Long() = prim::NumToTensor(%904), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %906 : int = prim::Constant[value=3](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %907 : int = aten::size(%input.9, %906), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %908 : Long() = prim::NumToTensor(%907), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %909 : Long() = aten::mul_(%899, %905), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %910 : Long() = aten::mul_(%909, %908), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %911 : int = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %912 : Byte() = aten::eq(%910, %911), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
  %913 : bool = prim::Constant[value=1](), scope: Inception3/InceptionA[Mixed_5b]/BasicConv2d[branch5x5_1]/BatchNorm2d[bn]
