graph(%0 : Float(10, 3, 224, 224)
      %1 : Float(64, 3, 7, 7)
      %2 : Float(64)
      %3 : Float(64)
      %4 : Float(64)
      %5 : Float(64)
      %6 : Long()
      %7 : Float(64, 64, 3, 3)
      %8 : Float(64)
      %9 : Float(64)
      %10 : Float(64)
      %11 : Float(64)
      %12 : Long()
      %13 : Float(64, 64, 3, 3)
      %14 : Float(64)
      %15 : Float(64)
      %16 : Float(64)
      %17 : Float(64)
      %18 : Long()
      %19 : Float(64, 64, 3, 3)
      %20 : Float(64)
      %21 : Float(64)
      %22 : Float(64)
      %23 : Float(64)
      %24 : Long()
      %25 : Float(64, 64, 3, 3)
      %26 : Float(64)
      %27 : Float(64)
      %28 : Float(64)
      %29 : Float(64)
      %30 : Long()
      %31 : Float(128, 64, 3, 3)
      %32 : Float(128)
      %33 : Float(128)
      %34 : Float(128)
      %35 : Float(128)
      %36 : Long()
      %37 : Float(128, 128, 3, 3)
      %38 : Float(128)
      %39 : Float(128)
      %40 : Float(128)
      %41 : Float(128)
      %42 : Long()
      %43 : Float(128, 64, 1, 1)
      %44 : Float(128)
      %45 : Float(128)
      %46 : Float(128)
      %47 : Float(128)
      %48 : Long()
      %49 : Float(128, 128, 3, 3)
      %50 : Float(128)
      %51 : Float(128)
      %52 : Float(128)
      %53 : Float(128)
      %54 : Long()
      %55 : Float(128, 128, 3, 3)
      %56 : Float(128)
      %57 : Float(128)
      %58 : Float(128)
      %59 : Float(128)
      %60 : Long()
      %61 : Float(256, 128, 3, 3)
      %62 : Float(256)
      %63 : Float(256)
      %64 : Float(256)
      %65 : Float(256)
      %66 : Long()
      %67 : Float(256, 256, 3, 3)
      %68 : Float(256)
      %69 : Float(256)
      %70 : Float(256)
      %71 : Float(256)
      %72 : Long()
      %73 : Float(256, 128, 1, 1)
      %74 : Float(256)
      %75 : Float(256)
      %76 : Float(256)
      %77 : Float(256)
      %78 : Long()
      %79 : Float(256, 256, 3, 3)
      %80 : Float(256)
      %81 : Float(256)
      %82 : Float(256)
      %83 : Float(256)
      %84 : Long()
      %85 : Float(256, 256, 3, 3)
      %86 : Float(256)
      %87 : Float(256)
      %88 : Float(256)
      %89 : Float(256)
      %90 : Long()
      %91 : Float(512, 256, 3, 3)
      %92 : Float(512)
      %93 : Float(512)
      %94 : Float(512)
      %95 : Float(512)
      %96 : Long()
      %97 : Float(512, 512, 3, 3)
      %98 : Float(512)
      %99 : Float(512)
      %100 : Float(512)
      %101 : Float(512)
      %102 : Long()
      %103 : Float(512, 256, 1, 1)
      %104 : Float(512)
      %105 : Float(512)
      %106 : Float(512)
      %107 : Float(512)
      %108 : Long()
      %109 : Float(512, 512, 3, 3)
      %110 : Float(512)
      %111 : Float(512)
      %112 : Float(512)
      %113 : Float(512)
      %114 : Long()
      %115 : Float(512, 512, 3, 3)
      %116 : Float(512)
      %117 : Float(512)
      %118 : Float(512)
      %119 : Float(512)
      %120 : Long()
      %121 : Float(1000, 512)
      %122 : Float(1000)) {
  %123 : Tensor = prim::Undefined(), scope: ResNet/Conv2d[conv1]
  %124 : int = prim::Constant[value=2](), scope: ResNet/Conv2d[conv1]
  %125 : int = prim::Constant[value=2](), scope: ResNet/Conv2d[conv1]
  %126 : int[] = prim::ListConstruct(%124, %125), scope: ResNet/Conv2d[conv1]
  %127 : int = prim::Constant[value=3](), scope: ResNet/Conv2d[conv1]
  %128 : int = prim::Constant[value=3](), scope: ResNet/Conv2d[conv1]
  %129 : int[] = prim::ListConstruct(%127, %128), scope: ResNet/Conv2d[conv1]
  %130 : int = prim::Constant[value=1](), scope: ResNet/Conv2d[conv1]
  %131 : int = prim::Constant[value=1](), scope: ResNet/Conv2d[conv1]
  %132 : int[] = prim::ListConstruct(%130, %131), scope: ResNet/Conv2d[conv1]
  %133 : bool = prim::Constant[value=0](), scope: ResNet/Conv2d[conv1]
  %134 : int = prim::Constant[value=0](), scope: ResNet/Conv2d[conv1]
  %135 : int = prim::Constant[value=0](), scope: ResNet/Conv2d[conv1]
  %136 : int[] = prim::ListConstruct(%134, %135), scope: ResNet/Conv2d[conv1]
  %137 : int = prim::Constant[value=1](), scope: ResNet/Conv2d[conv1]
  %138 : bool = prim::Constant[value=0](), scope: ResNet/Conv2d[conv1]
  %139 : bool = prim::Constant[value=0](), scope: ResNet/Conv2d[conv1]
  %140 : bool = prim::Constant[value=1](), scope: ResNet/Conv2d[conv1]
  %input.1 : Float(10, 64, 112, 112) = aten::_convolution(%0, %1, %123, %126, %129, %132, %133, %136, %137, %138, %139, %140), scope: ResNet/Conv2d[conv1]
  %142 : Long() = prim::Constant[value={1}](), scope: ResNet/BatchNorm2d[bn1]
  %143 : int = prim::Constant[value=1](), scope: ResNet/BatchNorm2d[bn1]
  %144 : Long() = aten::add_(%6, %142, %143), scope: ResNet/BatchNorm2d[bn1]
  %145 : int = prim::Constant[value=0](), scope: ResNet/BatchNorm2d[bn1]
  %146 : int = aten::size(%input.1, %145), scope: ResNet/BatchNorm2d[bn1]
  %147 : Long() = prim::NumToTensor(%146), scope: ResNet/BatchNorm2d[bn1]
  %148 : int = prim::Constant[value=1](), scope: ResNet/BatchNorm2d[bn1]
  %149 : int = aten::size(%input.1, %148), scope: ResNet/BatchNorm2d[bn1]
  %150 : Long() = prim::NumToTensor(%149), scope: ResNet/BatchNorm2d[bn1]
  %151 : int = prim::Constant[value=2](), scope: ResNet/BatchNorm2d[bn1]
  %152 : int = aten::size(%input.1, %151), scope: ResNet/BatchNorm2d[bn1]
  %153 : Long() = prim::NumToTensor(%152), scope: ResNet/BatchNorm2d[bn1]
  %154 : int = prim::Constant[value=3](), scope: ResNet/BatchNorm2d[bn1]
  %155 : int = aten::size(%input.1, %154), scope: ResNet/BatchNorm2d[bn1]
  %156 : Long() = prim::NumToTensor(%155), scope: ResNet/BatchNorm2d[bn1]
  %157 : Long() = aten::mul_(%147, %153), scope: ResNet/BatchNorm2d[bn1]
  %158 : Long() = aten::mul_(%157, %156), scope: ResNet/BatchNorm2d[bn1]
  %159 : int = prim::Constant[value=1](), scope: ResNet/BatchNorm2d[bn1]
  %160 : Byte() = aten::eq(%158, %159), scope: ResNet/BatchNorm2d[bn1]
  %161 : bool = prim::Constant[value=1](), scope: ResNet/BatchNorm2d[bn1]
  %162 : float = prim::Constant[value=0.1](), scope: ResNet/BatchNorm2d[bn1]
  %163 : float = prim::Constant[value=1e-05](), scope: ResNet/BatchNorm2d[bn1]
  %164 : bool = prim::Constant[value=1](), scope: ResNet/BatchNorm2d[bn1]
  %input.2 : Float(10, 64, 112, 112) = aten::batch_norm(%input.1, %2, %3, %4, %5, %161, %162, %163, %164), scope: ResNet/BatchNorm2d[bn1]
  %166 : float = prim::Constant[value=0](), scope: ResNet/ReLU[relu]
  %167 : float = prim::Constant[value=0](), scope: ResNet/ReLU[relu]
  %input.3 : Float(10, 64, 112, 112) = aten::threshold_(%input.2, %166, %167), scope: ResNet/ReLU[relu]
  %169 : int = prim::Constant[value=3](), scope: ResNet/MaxPool2d[maxpool]
  %170 : int = prim::Constant[value=3](), scope: ResNet/MaxPool2d[maxpool]
  %171 : int[] = prim::ListConstruct(%169, %170), scope: ResNet/MaxPool2d[maxpool]
  %172 : int = prim::Constant[value=2](), scope: ResNet/MaxPool2d[maxpool]
  %173 : int = prim::Constant[value=2](), scope: ResNet/MaxPool2d[maxpool]
  %174 : int[] = prim::ListConstruct(%172, %173), scope: ResNet/MaxPool2d[maxpool]
  %175 : int = prim::Constant[value=1](), scope: ResNet/MaxPool2d[maxpool]
  %176 : int = prim::Constant[value=1](), scope: ResNet/MaxPool2d[maxpool]
  %177 : int[] = prim::ListConstruct(%175, %176), scope: ResNet/MaxPool2d[maxpool]
  %178 : int = prim::Constant[value=1](), scope: ResNet/MaxPool2d[maxpool]
  %179 : int = prim::Constant[value=1](), scope: ResNet/MaxPool2d[maxpool]
  %180 : int[] = prim::ListConstruct(%178, %179), scope: ResNet/MaxPool2d[maxpool]
  %181 : bool = prim::Constant[value=0](), scope: ResNet/MaxPool2d[maxpool]
  %182 : Float(10, 64, 56, 56), %183 : Long(10, 64, 56, 56) = aten::max_pool2d_with_indices(%input.3, %171, %174, %177, %180, %181), scope: ResNet/MaxPool2d[maxpool]
  %184 : Tensor = prim::Undefined(), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %185 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %186 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %187 : int[] = prim::ListConstruct(%185, %186), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %188 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %189 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %190 : int[] = prim::ListConstruct(%188, %189), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %191 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %192 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %193 : int[] = prim::ListConstruct(%191, %192), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %194 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %195 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %196 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %197 : int[] = prim::ListConstruct(%195, %196), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %198 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %199 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %200 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %201 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %input.4 : Float(10, 64, 56, 56) = aten::_convolution(%182, %7, %184, %187, %190, %193, %194, %197, %198, %199, %200, %201), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv1]
  %203 : Long() = prim::Constant[value={1}](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %204 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %205 : Long() = aten::add_(%12, %203, %204), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %206 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %207 : int = aten::size(%input.4, %206), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %208 : Long() = prim::NumToTensor(%207), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %209 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %210 : int = aten::size(%input.4, %209), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %211 : Long() = prim::NumToTensor(%210), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %212 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %213 : int = aten::size(%input.4, %212), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %214 : Long() = prim::NumToTensor(%213), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %215 : int = prim::Constant[value=3](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %216 : int = aten::size(%input.4, %215), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %217 : Long() = prim::NumToTensor(%216), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %218 : Long() = aten::mul_(%208, %214), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %219 : Long() = aten::mul_(%218, %217), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %220 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %221 : Byte() = aten::eq(%219, %220), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %222 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %223 : float = prim::Constant[value=0.1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %224 : float = prim::Constant[value=1e-05](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %225 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %input.5 : Float(10, 64, 56, 56) = aten::batch_norm(%input.4, %8, %9, %10, %11, %222, %223, %224, %225), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn1]
  %227 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/ReLU[relu]
  %228 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/ReLU[relu]
  %229 : Float(10, 64, 56, 56) = aten::threshold_(%input.5, %227, %228), scope: ResNet/Sequential[layer1]/BasicBlock[0]/ReLU[relu]
  %230 : Tensor = prim::Undefined(), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %231 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %232 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %233 : int[] = prim::ListConstruct(%231, %232), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %234 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %235 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %236 : int[] = prim::ListConstruct(%234, %235), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %237 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %238 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %239 : int[] = prim::ListConstruct(%237, %238), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %240 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %241 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %242 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %243 : int[] = prim::ListConstruct(%241, %242), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %244 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %245 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %246 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %247 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %input.6 : Float(10, 64, 56, 56) = aten::_convolution(%229, %13, %230, %233, %236, %239, %240, %243, %244, %245, %246, %247), scope: ResNet/Sequential[layer1]/BasicBlock[0]/Conv2d[conv2]
  %249 : Long() = prim::Constant[value={1}](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %250 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %251 : Long() = aten::add_(%18, %249, %250), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %252 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %253 : int = aten::size(%input.6, %252), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %254 : Long() = prim::NumToTensor(%253), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %255 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %256 : int = aten::size(%input.6, %255), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %257 : Long() = prim::NumToTensor(%256), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %258 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %259 : int = aten::size(%input.6, %258), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %260 : Long() = prim::NumToTensor(%259), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %261 : int = prim::Constant[value=3](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %262 : int = aten::size(%input.6, %261), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %263 : Long() = prim::NumToTensor(%262), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %264 : Long() = aten::mul_(%254, %260), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %265 : Long() = aten::mul_(%264, %263), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %266 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %267 : Byte() = aten::eq(%265, %266), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %268 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %269 : float = prim::Constant[value=0.1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %270 : float = prim::Constant[value=1e-05](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %271 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %272 : Float(10, 64, 56, 56) = aten::batch_norm(%input.6, %14, %15, %16, %17, %268, %269, %270, %271), scope: ResNet/Sequential[layer1]/BasicBlock[0]/BatchNorm2d[bn2]
  %273 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[0]
  %input.7 : Float(10, 64, 56, 56) = aten::add_(%272, %182, %273), scope: ResNet/Sequential[layer1]/BasicBlock[0]
  %275 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/ReLU[relu]
  %276 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[0]/ReLU[relu]
  %277 : Float(10, 64, 56, 56) = aten::threshold_(%input.7, %275, %276), scope: ResNet/Sequential[layer1]/BasicBlock[0]/ReLU[relu]
  %278 : Tensor = prim::Undefined(), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %279 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %280 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %281 : int[] = prim::ListConstruct(%279, %280), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %282 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %283 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %284 : int[] = prim::ListConstruct(%282, %283), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %285 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %286 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %287 : int[] = prim::ListConstruct(%285, %286), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %288 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %289 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %290 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %291 : int[] = prim::ListConstruct(%289, %290), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %292 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %293 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %294 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %295 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %input.8 : Float(10, 64, 56, 56) = aten::_convolution(%277, %19, %278, %281, %284, %287, %288, %291, %292, %293, %294, %295), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv1]
  %297 : Long() = prim::Constant[value={1}](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %298 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %299 : Long() = aten::add_(%24, %297, %298), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %300 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %301 : int = aten::size(%input.8, %300), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %302 : Long() = prim::NumToTensor(%301), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %303 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %304 : int = aten::size(%input.8, %303), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %305 : Long() = prim::NumToTensor(%304), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %306 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %307 : int = aten::size(%input.8, %306), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %308 : Long() = prim::NumToTensor(%307), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %309 : int = prim::Constant[value=3](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %310 : int = aten::size(%input.8, %309), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %311 : Long() = prim::NumToTensor(%310), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %312 : Long() = aten::mul_(%302, %308), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %313 : Long() = aten::mul_(%312, %311), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %314 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %315 : Byte() = aten::eq(%313, %314), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %316 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %317 : float = prim::Constant[value=0.1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %318 : float = prim::Constant[value=1e-05](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %319 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %input.9 : Float(10, 64, 56, 56) = aten::batch_norm(%input.8, %20, %21, %22, %23, %316, %317, %318, %319), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn1]
  %321 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/ReLU[relu]
  %322 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/ReLU[relu]
  %323 : Float(10, 64, 56, 56) = aten::threshold_(%input.9, %321, %322), scope: ResNet/Sequential[layer1]/BasicBlock[1]/ReLU[relu]
  %324 : Tensor = prim::Undefined(), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %325 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %326 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %327 : int[] = prim::ListConstruct(%325, %326), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %328 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %329 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %330 : int[] = prim::ListConstruct(%328, %329), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %331 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %332 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %333 : int[] = prim::ListConstruct(%331, %332), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %334 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %335 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %336 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %337 : int[] = prim::ListConstruct(%335, %336), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %338 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %339 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %340 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %341 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %input.10 : Float(10, 64, 56, 56) = aten::_convolution(%323, %25, %324, %327, %330, %333, %334, %337, %338, %339, %340, %341), scope: ResNet/Sequential[layer1]/BasicBlock[1]/Conv2d[conv2]
  %343 : Long() = prim::Constant[value={1}](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %344 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %345 : Long() = aten::add_(%30, %343, %344), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %346 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %347 : int = aten::size(%input.10, %346), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %348 : Long() = prim::NumToTensor(%347), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %349 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %350 : int = aten::size(%input.10, %349), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %351 : Long() = prim::NumToTensor(%350), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %352 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %353 : int = aten::size(%input.10, %352), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %354 : Long() = prim::NumToTensor(%353), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %355 : int = prim::Constant[value=3](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %356 : int = aten::size(%input.10, %355), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %357 : Long() = prim::NumToTensor(%356), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %358 : Long() = aten::mul_(%348, %354), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %359 : Long() = aten::mul_(%358, %357), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %360 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %361 : Byte() = aten::eq(%359, %360), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %362 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %363 : float = prim::Constant[value=0.1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %364 : float = prim::Constant[value=1e-05](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %365 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %366 : Float(10, 64, 56, 56) = aten::batch_norm(%input.10, %26, %27, %28, %29, %362, %363, %364, %365), scope: ResNet/Sequential[layer1]/BasicBlock[1]/BatchNorm2d[bn2]
  %367 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer1]/BasicBlock[1]
  %input.11 : Float(10, 64, 56, 56) = aten::add_(%366, %277, %367), scope: ResNet/Sequential[layer1]/BasicBlock[1]
  %369 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/ReLU[relu]
  %370 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer1]/BasicBlock[1]/ReLU[relu]
  %371 : Float(10, 64, 56, 56) = aten::threshold_(%input.11, %369, %370), scope: ResNet/Sequential[layer1]/BasicBlock[1]/ReLU[relu]
  %372 : Tensor = prim::Undefined(), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %373 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %374 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %375 : int[] = prim::ListConstruct(%373, %374), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %376 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %377 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %378 : int[] = prim::ListConstruct(%376, %377), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %379 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %380 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %381 : int[] = prim::ListConstruct(%379, %380), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %382 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %383 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %384 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %385 : int[] = prim::ListConstruct(%383, %384), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %386 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %387 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %388 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %389 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %input.12 : Float(10, 128, 28, 28) = aten::_convolution(%371, %31, %372, %375, %378, %381, %382, %385, %386, %387, %388, %389), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv1]
  %391 : Long() = prim::Constant[value={1}](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %392 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %393 : Long() = aten::add_(%36, %391, %392), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %394 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %395 : int = aten::size(%input.12, %394), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %396 : Long() = prim::NumToTensor(%395), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %397 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %398 : int = aten::size(%input.12, %397), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %399 : Long() = prim::NumToTensor(%398), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %400 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %401 : int = aten::size(%input.12, %400), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %402 : Long() = prim::NumToTensor(%401), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %403 : int = prim::Constant[value=3](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %404 : int = aten::size(%input.12, %403), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %405 : Long() = prim::NumToTensor(%404), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %406 : Long() = aten::mul_(%396, %402), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %407 : Long() = aten::mul_(%406, %405), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %408 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %409 : Byte() = aten::eq(%407, %408), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %410 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %411 : float = prim::Constant[value=0.1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %412 : float = prim::Constant[value=1e-05](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %413 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %input.13 : Float(10, 128, 28, 28) = aten::batch_norm(%input.12, %32, %33, %34, %35, %410, %411, %412, %413), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn1]
  %415 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/ReLU[relu]
  %416 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/ReLU[relu]
  %417 : Float(10, 128, 28, 28) = aten::threshold_(%input.13, %415, %416), scope: ResNet/Sequential[layer2]/BasicBlock[0]/ReLU[relu]
  %418 : Tensor = prim::Undefined(), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %419 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %420 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %421 : int[] = prim::ListConstruct(%419, %420), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %422 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %423 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %424 : int[] = prim::ListConstruct(%422, %423), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %425 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %426 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %427 : int[] = prim::ListConstruct(%425, %426), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %428 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %429 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %430 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %431 : int[] = prim::ListConstruct(%429, %430), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %432 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %433 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %434 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %435 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %input.14 : Float(10, 128, 28, 28) = aten::_convolution(%417, %37, %418, %421, %424, %427, %428, %431, %432, %433, %434, %435), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Conv2d[conv2]
  %437 : Long() = prim::Constant[value={1}](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %438 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %439 : Long() = aten::add_(%42, %437, %438), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %440 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %441 : int = aten::size(%input.14, %440), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %442 : Long() = prim::NumToTensor(%441), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %443 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %444 : int = aten::size(%input.14, %443), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %445 : Long() = prim::NumToTensor(%444), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %446 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %447 : int = aten::size(%input.14, %446), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %448 : Long() = prim::NumToTensor(%447), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %449 : int = prim::Constant[value=3](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %450 : int = aten::size(%input.14, %449), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %451 : Long() = prim::NumToTensor(%450), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %452 : Long() = aten::mul_(%442, %448), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %453 : Long() = aten::mul_(%452, %451), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %454 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %455 : Byte() = aten::eq(%453, %454), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %456 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %457 : float = prim::Constant[value=0.1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %458 : float = prim::Constant[value=1e-05](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %459 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %460 : Float(10, 128, 28, 28) = aten::batch_norm(%input.14, %38, %39, %40, %41, %456, %457, %458, %459), scope: ResNet/Sequential[layer2]/BasicBlock[0]/BatchNorm2d[bn2]
  %461 : Tensor = prim::Undefined(), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %462 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %463 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %464 : int[] = prim::ListConstruct(%462, %463), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %465 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %466 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %467 : int[] = prim::ListConstruct(%465, %466), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %468 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %469 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %470 : int[] = prim::ListConstruct(%468, %469), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %471 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %472 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %473 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %474 : int[] = prim::ListConstruct(%472, %473), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %475 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %476 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %477 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %478 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %input.15 : Float(10, 128, 28, 28) = aten::_convolution(%371, %43, %461, %464, %467, %470, %471, %474, %475, %476, %477, %478), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/Conv2d[0]
  %480 : Long() = prim::Constant[value={1}](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %481 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %482 : Long() = aten::add_(%48, %480, %481), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %483 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %484 : int = aten::size(%input.15, %483), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %485 : Long() = prim::NumToTensor(%484), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %486 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %487 : int = aten::size(%input.15, %486), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %488 : Long() = prim::NumToTensor(%487), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %489 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %490 : int = aten::size(%input.15, %489), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %491 : Long() = prim::NumToTensor(%490), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %492 : int = prim::Constant[value=3](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %493 : int = aten::size(%input.15, %492), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %494 : Long() = prim::NumToTensor(%493), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %495 : Long() = aten::mul_(%485, %491), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %496 : Long() = aten::mul_(%495, %494), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %497 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %498 : Byte() = aten::eq(%496, %497), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %499 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %500 : float = prim::Constant[value=0.1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %501 : float = prim::Constant[value=1e-05](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %502 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %503 : Float(10, 128, 28, 28) = aten::batch_norm(%input.15, %44, %45, %46, %47, %499, %500, %501, %502), scope: ResNet/Sequential[layer2]/BasicBlock[0]/Sequential[downsample]/BatchNorm2d[1]
  %504 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[0]
  %input.16 : Float(10, 128, 28, 28) = aten::add_(%460, %503, %504), scope: ResNet/Sequential[layer2]/BasicBlock[0]
  %506 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/ReLU[relu]
  %507 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[0]/ReLU[relu]
  %508 : Float(10, 128, 28, 28) = aten::threshold_(%input.16, %506, %507), scope: ResNet/Sequential[layer2]/BasicBlock[0]/ReLU[relu]
  %509 : Tensor = prim::Undefined(), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %510 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %511 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %512 : int[] = prim::ListConstruct(%510, %511), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %513 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %514 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %515 : int[] = prim::ListConstruct(%513, %514), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %516 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %517 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %518 : int[] = prim::ListConstruct(%516, %517), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %519 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %520 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %521 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %522 : int[] = prim::ListConstruct(%520, %521), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %523 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %524 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %525 : bool = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %526 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %input.17 : Float(10, 128, 28, 28) = aten::_convolution(%508, %49, %509, %512, %515, %518, %519, %522, %523, %524, %525, %526), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv1]
  %528 : Long() = prim::Constant[value={1}](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %529 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %530 : Long() = aten::add_(%54, %528, %529), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %531 : int = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %532 : int = aten::size(%input.17, %531), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %533 : Long() = prim::NumToTensor(%532), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %534 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %535 : int = aten::size(%input.17, %534), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %536 : Long() = prim::NumToTensor(%535), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %537 : int = prim::Constant[value=2](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %538 : int = aten::size(%input.17, %537), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %539 : Long() = prim::NumToTensor(%538), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %540 : int = prim::Constant[value=3](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %541 : int = aten::size(%input.17, %540), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %542 : Long() = prim::NumToTensor(%541), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %543 : Long() = aten::mul_(%533, %539), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %544 : Long() = aten::mul_(%543, %542), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %545 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %546 : Byte() = aten::eq(%544, %545), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %547 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %548 : float = prim::Constant[value=0.1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %549 : float = prim::Constant[value=1e-05](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %550 : bool = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %input.18 : Float(10, 128, 28, 28) = aten::batch_norm(%input.17, %50, %51, %52, %53, %547, %548, %549, %550), scope: ResNet/Sequential[layer2]/BasicBlock[1]/BatchNorm2d[bn1]
  %552 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/ReLU[relu]
  %553 : float = prim::Constant[value=0](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/ReLU[relu]
  %554 : Float(10, 128, 28, 28) = aten::threshold_(%input.18, %552, %553), scope: ResNet/Sequential[layer2]/BasicBlock[1]/ReLU[relu]
  %555 : Tensor = prim::Undefined(), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv2]
  %556 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv2]
  %557 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv2]
  %558 : int[] = prim::ListConstruct(%556, %557), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv2]
  %559 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv2]
  %560 : int = prim::Constant[value=1](), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv2]
  %561 : int[] = prim::ListConstruct(%559, %560), scope: ResNet/Sequential[layer2]/BasicBlock[1]/Conv2d[conv2]
